#pragma once
//Дано вектор V.У кожній групі його елементів, що закінчуються на ту
//саму цифру, знайти суму значень цих елементів, за винятком початкового
//елемента групи(передбачається, що елементи групи розташовуються в тому ж
//	порядку, що й у вихідному векторі).Якщо група складається з єдиного елемента,
//	то сума повинна дорівнювати 0. Для кожної групи вивести відповідну їй цифру і
//	знайдену суму, впорядковуючи пари, що виводяться за зростанням цифр.
//	Використовувати допоміжне відображення M та варіант угрупування, описаний у
//	задачі Задача_3_7.Для знаходження сум використовувати алгоритм accumulate .

/*
Є вектор V. всі числа які закінчуються на ту саму цифру, треба знайти їх сумму окрім першого елемента кожної групи, його ураховувати не треба
сума чисел має бути розташована так, як у самому векторі елементи, все попорядку.
якщо в групі тільки 1 елемент, то яким би він не був сума має = 0
використовувати доп відображення М та варік угрупування описаний у задачі 3_7 для знаходження сум використовувати алгоритм аккумулейт
*/
#include <iostream>
#include <vector>
#include <numeric>
using namespace std;



void task6()
{
    vector<int> V;
    vector<int> TV;
    int target;
    int element;

    for (int i = 0; i < 100; i++)
    {
        cout << "Send element (send 0 if thats all): ";
        cin >> element;
        V.push_back(element);
        if (element == 0)
        {
            break;
        }
    }
    


    cout << "Send number: ";
    cin >> target;

    int sum;

    for (int num : V) 
    {
        if (num % 10 == target)
            TV.push_back(num);
    }

    if (TV.size() > 1)
    {
        sum = accumulate(TV.begin(), TV.end(), -TV[0]);
    }
    else
    {
        sum = 0;
    }

    cout << "Сума чисел, які закінчуються на " << target << ": " << sum << endl;
    system("pause");
}